coolcoderme/esp32-tinycore/bootloader/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# Older Function EV boards are rev < 3. New ECO5 boards should set this to n.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_0=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM: map into the CPU window, do NOT add it to the IDF heap.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MEMMAP=y
CONFIG_SPIRAM_MEMTEST=n

# We hand off to Linux and never return.
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_INT_WDT=n
CONFIG_ESP_INT_WDT=n

CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
